**Books (Core) Database Exercise**

Author: **Pieter Slabber**

 ![png](Books_ERD.PNG))

**Part 1: Design an ERD**

Create an ERD (figure out how many tables to include and the relationships between them) to represent a database that tracks users and their favorite books. Here are some considerations as you design the database:


For the purposes of this assignment, you may assume that each book only has one author (or that we are only tracking the primary author), but that the same author may have written multiple boo
ks.
Each user should have a first name, last name, and em
ail.
We will be saving a list of each user's favorite b
ooks.
Each book should have a title and an author. (The author's whole name can be one attribute)
Note that each user will have multiple favorite books, and a book could certainly be the favorite of many
 users.
Use the MySQL Workbench for designing 
the ERD.
Hint: When you link two tables with a many to many relationship, MySQL Workbench will automatically create a joiner table for you! It will also automatically make the keys primary keys, which you will want to uncheck.

**Part 2: Create the database in Python**

Continue working in Jupyter Notebook with the ERD image.

Rather than creating the database in MySQL workbench with forward engineering, we are going to develop our Python skills by creating the database in Python using PyMySQL that you practiced in the "MySQL with Python" lesson.

Note that working with MySQL via Python will be a required component of the belt exam, so getting comfortable with it now will help prepare you!

You will need to create a connection. This time, you may wish to call it 
"Code Below:/database"
connection = "mysql+pymysql://root:root@local
/books"copy
Normally, you would have to take the time to transform the original .csv file from your client into the appropriate normalized tables. However, for this task, the transformation steps have been completed for you and you are provided a .csv for each table you will need. (Note that you will be learning and practicing efficient ways to make these transformations next week!)

**Part 3: Exporting the database and committing to GitHub**

Now that you've created your database and verified it works, open MySQL Workbench and use the Export Database tool to save the .SQL file for your database in your assignment repository.

Add both of these files to your GitHub repository:

Jupyter Notebook (including the ERD from Part 1 and code for Part 2)
Exported .sql file.

**Create the Connection to the local MySQL instance:**

In [1]:
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
connection_str = "mysql+pymysql://root:root@localhost/books"

**Create the Engine:**

In [2]:
engine = create_engine(connection_str)

**Verify that the database exists. If not create it**

In [3]:
# Check if the database exists. If not, create it.
if database_exists(connection_str) == False:
  create_database(connection_str)
else:
  print('The database already exists')

In [4]:
import pandas as pd
df = pd.read_csv('data/books_data.csv')
df.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

**Add this table to the database**

In [5]:
df.to_sql('books', engine, if_exists = 'replace')

6

In [6]:
df = pd.read_csv('data/users_data.csv')
df.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

**Add this table to the database**

In [7]:
df.to_sql('users', engine, if_exists = 'replace')

3

In [8]:
df = pd.read_csv('data/authors_data.csv')
df.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

**Add this table to the database**

In [9]:
df.to_sql('authors', engine, if_exists = 'replace')

5

In [10]:
df = pd.read_csv('data/favorites_data.csv')
df.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

**Add this tables to the database**

In [11]:
df.to_sql('favorites', engine, if_exists = 'replace')

7

**Testing the database with a query**

In [12]:
q = """SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));"""
pd.read_sql(q, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1